[Killed] ConditionalExpression
api/controllers/ToDoController.js:15:19
     Note: a helper function can't be extracted since passing an undefined 
     model raises a ReferenceError before calling the helper.
   */
-const ToDoModel = typeof ToDo !== "undefined" ? ToDo : {};
+const ToDoModel = true ? ToDo : {};
 const ToDoService = require("../services/ToDoService")(ToDoModel);
 
killedBy: ToDoController create Successfully
statusReason: ToDo is not defined

[Killed] EqualityOperator
api/controllers/ToDoController.js:15:19
     Note: a helper function can't be extracted since passing an undefined 
     model raises a ReferenceError before calling the helper.
   */
-const ToDoModel = typeof ToDo !== "undefined" ? ToDo : {};
+const ToDoModel = typeof ToDo === "undefined" ? ToDo : {};
 const ToDoService = require("../services/ToDoService")(ToDoModel);
 
killedBy: ToDoController create Successfully
statusReason: ToDo is not defined

[Killed] BlockStatement
api/controllers/ToDoController.js:21:37
 const { mapErrorToRes } = require("./errorUtils");
 
 module.exports = {
-  create: async function (req, res) {
-    try {
-      const { text, state } = req.body;
-      const { userId } = req.session;
-
-      if (!text || !state) return res.badRequest("Text and state are required");
-
-      const newToDo = await ToDoService.create(text, state, userId);
-      return res.json(newToDo);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
-  },
+  create: async function (req, res) {},
 
   delete: async function (req, res) {
killedBy: ToDoController create Successfully
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:22:9
 
 module.exports = {
   create: async function (req, res) {
-    try {
-      const { text, state } = req.body;
-      const { userId } = req.session;
-
-      if (!text || !state) return res.badRequest("Text and state are required");
-
-      const newToDo = await ToDoService.create(text, state, userId);
-      return res.json(newToDo);
-    } catch (error) {
+    try {} catch (error) {
       mapErrorToRes(error, res);
     }
killedBy: ToDoController create Successfully
statusReason: Unspecified AssertionError

[Killed] ConditionalExpression
api/controllers/ToDoController.js:26:11
       const { text, state } = req.body;
       const { userId } = req.session;
 
-      if (!text || !state) return res.badRequest("Text and state are required");
+      if (true) return res.badRequest("Text and state are required");
 
       const newToDo = await ToDoService.create(text, state, userId);
killedBy: ToDoController create Successfully
statusReason: Unspecified AssertionError

[Killed] LogicalOperator
api/controllers/ToDoController.js:26:11
       const { text, state } = req.body;
       const { userId } = req.session;
 
-      if (!text || !state) return res.badRequest("Text and state are required");
+      if (!text && !state) return res.badRequest("Text and state are required");
 
       const newToDo = await ToDoService.create(text, state, userId);
killedBy: ToDoController create Incomplete body
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:30:21
 
       const newToDo = await ToDoService.create(text, state, userId);
       return res.json(newToDo);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
+    } catch (error) {}
   },
 
killedBy: ToDoController create ToDoService's error
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:35:37
     }
   },
 
-  delete: async function (req, res) {
-    const { id } = req.params;
-    const { userId } = req.session;
-
-    if (!id) return res.badRequest("Id is required");
-
-    try {
-      const deletedToDo = await ToDoService.deleteById(id, userId);
-      return res.json(deletedToDo);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
-  },
+  delete: async function (req, res) {},
 
   findAll: async function (req, res) {
killedBy: ToDoController delete Successfully
statusReason: Unspecified AssertionError

[Killed] BooleanLiteral
api/controllers/ToDoController.js:39:9
     const { id } = req.params;
     const { userId } = req.session;
 
-    if (!id) return res.badRequest("Id is required");
+    if (id) return res.badRequest("Id is required");
 
     try {
killedBy: ToDoController delete Successfully
statusReason: Unspecified AssertionError

[Killed] ConditionalExpression
api/controllers/ToDoController.js:39:9
     const { id } = req.params;
     const { userId } = req.session;
 
-    if (!id) return res.badRequest("Id is required");
+    if (false) return res.badRequest("Id is required");
 
     try {
killedBy: ToDoController delete Missing param
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:41:9
 
     if (!id) return res.badRequest("Id is required");
 
-    try {
-      const deletedToDo = await ToDoService.deleteById(id, userId);
-      return res.json(deletedToDo);
-    } catch (error) {
+    try {} catch (error) {
       mapErrorToRes(error, res);
     }
killedBy: ToDoController delete Successfully
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:44:21
     try {
       const deletedToDo = await ToDoService.deleteById(id, userId);
       return res.json(deletedToDo);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
+    } catch (error) {}
   },
 
killedBy: ToDoController delete ToDoService's error
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:49:38
     }
   },
 
-  findAll: async function (req, res) {
-    const { userId } = req.session;
-
-    try {
-      const allToDos = await ToDoService.findAll(userId);
-      return res.json(allToDos);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
-  },
+  findAll: async function (req, res) {},
 
   findOne: async function (req, res) {
killedBy: ToDoController findAll Successfully
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:52:9
   findAll: async function (req, res) {
     const { userId } = req.session;
 
-    try {
-      const allToDos = await ToDoService.findAll(userId);
-      return res.json(allToDos);
-    } catch (error) {
+    try {} catch (error) {
       mapErrorToRes(error, res);
     }
killedBy: ToDoController findAll Successfully
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:55:21
     try {
       const allToDos = await ToDoService.findAll(userId);
       return res.json(allToDos);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
+    } catch (error) {}
   },
 
killedBy: ToDoController findAll ToDoService's error
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:60:38
     }
   },
 
-  findOne: async function (req, res) {
-    const { id } = req.params;
-    const { userId } = req.session;
-
-    try {
-      const toDo = await ToDoService.findById(id, userId);
-      return res.json(toDo);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
-  },
+  findOne: async function (req, res) {},
 
   changeState: async function (req, res) {
killedBy: ToDoController findOne Successfully
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:64:9
     const { id } = req.params;
     const { userId } = req.session;
 
-    try {
-      const toDo = await ToDoService.findById(id, userId);
-      return res.json(toDo);
-    } catch (error) {
+    try {} catch (error) {
       mapErrorToRes(error, res);
     }
killedBy: ToDoController findOne Successfully
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:67:21
     try {
       const toDo = await ToDoService.findById(id, userId);
       return res.json(toDo);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
+    } catch (error) {}
   },
 
killedBy: ToDoController findOne Entity not found
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:72:42
     }
   },
 
-  changeState: async function (req, res) {
-    const { id } = req.params;
-    const { state } = req.body;
-    const { userId } = req.session;
-
-    if (!id) return res.badRequest("Id is required");
-    if (!state) return res.badRequest("New state is required");
-
-    try {
-      const updatedToDo = await ToDoService.changeState(id, userId, state);
-      return res.json(updatedToDo);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
-  },
+  changeState: async function (req, res) {},
 };
 
killedBy: ToDoController changeState Successfully
statusReason: Unspecified AssertionError

[Killed] ConditionalExpression
api/controllers/ToDoController.js:78:9
     const { userId } = req.session;
 
     if (!id) return res.badRequest("Id is required");
-    if (!state) return res.badRequest("New state is required");
+    if (false) return res.badRequest("New state is required");
 
     try {
killedBy: ToDoController changeState Missing body
statusReason: Unspecified AssertionError

[Killed] BooleanLiteral
api/controllers/ToDoController.js:78:9
     const { userId } = req.session;
 
     if (!id) return res.badRequest("Id is required");
-    if (!state) return res.badRequest("New state is required");
+    if (state) return res.badRequest("New state is required");
 
     try {
killedBy: ToDoController changeState Successfully
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:80:9
     if (!id) return res.badRequest("Id is required");
     if (!state) return res.badRequest("New state is required");
 
-    try {
-      const updatedToDo = await ToDoService.changeState(id, userId, state);
-      return res.json(updatedToDo);
-    } catch (error) {
+    try {} catch (error) {
       mapErrorToRes(error, res);
     }
killedBy: ToDoController changeState Successfully
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/ToDoController.js:83:21
     try {
       const updatedToDo = await ToDoService.changeState(id, userId, state);
       return res.json(updatedToDo);
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
+    } catch (error) {}
   },
 };
killedBy: ToDoController changeState ToDoService's error
statusReason: Unspecified AssertionError
