[Killed] EqualityOperator
api/controllers/AuthenticationController.js:1:19
-const UserModel = typeof User !== "undefined" ? User : {};
+const UserModel = typeof User === "undefined" ? User : {};
 const AuthenticationService = require("../services/AuthenticationService")(
   UserModel
killedBy: AuthenticationController login should return 400 if 'user' or 'pass' is missing
statusReason: User is not defined

[Killed] ConditionalExpression
api/controllers/AuthenticationController.js:1:19
-const UserModel = typeof User !== "undefined" ? User : {};
+const UserModel = true ? User : {};
 const AuthenticationService = require("../services/AuthenticationService")(
   UserModel
killedBy: AuthenticationController login should return 400 if 'user' or 'pass' is missing
statusReason: User is not defined

[Killed] BlockStatement
api/controllers/AuthenticationController.js:9:36
 const { mapErrorToRes } = require("./errorUtils");
 
 module.exports = {
-  login: async function (req, res) {
-    const { user, pass } = req.body;
-
-    if (!user || !pass) {
-      return res.badRequest("User and password are required");
-    }
-
-    try {
-      const foundUser = await AuthenticationService.login(user, pass);
-      req.session.userId = foundUser.id;
-      return res.json({ message: `User ${foundUser.user} logged in` });
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
-  },
+  login: async function (req, res) {},
 
   logout: function (req, res) {
killedBy: AuthenticationController login should return 400 if 'user' or 'pass' is missing
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/AuthenticationController.js:12:25
   login: async function (req, res) {
     const { user, pass } = req.body;
 
-    if (!user || !pass) {
-      return res.badRequest("User and password are required");
-    }
+    if (!user || !pass) {}
 
     try {
killedBy: AuthenticationController login should return 400 if 'user' or 'pass' is missing
statusReason: Unspecified AssertionError

[Killed] ConditionalExpression
api/controllers/AuthenticationController.js:12:9
   login: async function (req, res) {
     const { user, pass } = req.body;
 
-    if (!user || !pass) {
+    if (true) {
       return res.badRequest("User and password are required");
     }
killedBy: AuthenticationController login should handle DB_ERROR from service
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/AuthenticationController.js:16:9
       return res.badRequest("User and password are required");
     }
 
-    try {
-      const foundUser = await AuthenticationService.login(user, pass);
-      req.session.userId = foundUser.id;
-      return res.json({ message: `User ${foundUser.user} logged in` });
-    } catch (error) {
+    try {} catch (error) {
       mapErrorToRes(error, res);
     }
killedBy: AuthenticationController login should handle DB_ERROR from service
statusReason: Unspecified AssertionError

[Survived] StringLiteral
api/controllers/AuthenticationController.js:19:34
     try {
       const foundUser = await AuthenticationService.login(user, pass);
       req.session.userId = foundUser.id;
-      return res.json({ message: `User ${foundUser.user} logged in` });
+      return res.json({ message: `` });
     } catch (error) {
       mapErrorToRes(error, res);

[Killed] BlockStatement
api/controllers/AuthenticationController.js:20:21
       const foundUser = await AuthenticationService.login(user, pass);
       req.session.userId = foundUser.id;
       return res.json({ message: `User ${foundUser.user} logged in` });
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
+    } catch (error) {}
   },
 
killedBy: AuthenticationController login should handle DB_ERROR from service
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/AuthenticationController.js:25:31
     }
   },
 
-  logout: function (req, res) {
-    try {
-      AuthenticationService.logout();
-      req.session.destroy();
-      return res.json({ message: "Logged out" });
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
-  },
+  logout: function (req, res) {},
 
   signup: async function (req, res) {
killedBy: AuthenticationController logout should destroy session and return json on successful logout
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/AuthenticationController.js:26:9
   },
 
   logout: function (req, res) {
-    try {
-      AuthenticationService.logout();
-      req.session.destroy();
-      return res.json({ message: "Logged out" });
-    } catch (error) {
+    try {} catch (error) {
       mapErrorToRes(error, res);
     }
killedBy: AuthenticationController logout should destroy session and return json on successful logout
statusReason: Unspecified AssertionError

[Survived] StringLiteral
api/controllers/AuthenticationController.js:29:34
     try {
       AuthenticationService.logout();
       req.session.destroy();
-      return res.json({ message: "Logged out" });
+      return res.json({ message: "" });
     } catch (error) {
       mapErrorToRes(error, res);

[Survived] ObjectLiteral
api/controllers/AuthenticationController.js:29:23
     try {
       AuthenticationService.logout();
       req.session.destroy();
-      return res.json({ message: "Logged out" });
+      return res.json({});
     } catch (error) {
       mapErrorToRes(error, res);

[NoCoverage] BlockStatement
api/controllers/AuthenticationController.js:30:21
       AuthenticationService.logout();
       req.session.destroy();
       return res.json({ message: "Logged out" });
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
+    } catch (error) {}
   },
 

[Killed] BlockStatement
api/controllers/AuthenticationController.js:35:37
     }
   },
 
-  signup: async function (req, res) {
-    const { user, pass } = req.body;
-
-    if (!user || !pass) {
-      return res.badRequest("User and password are required");
-    }
-
-    try {
-      const newUser = await AuthenticationService.signup(user, pass);
-      req.session.userId = newUser.id;
-      return res.json({ message: `User ${newUser.user} signed up` });
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
-  },
+  signup: async function (req, res) {},
 
   status: function (req, res) {
killedBy: AuthenticationController signup should return 400 if 'user' or 'pass' is missing
statusReason: Unspecified AssertionError

[Killed] BooleanLiteral
api/controllers/AuthenticationController.js:38:18
   signup: async function (req, res) {
     const { user, pass } = req.body;
 
-    if (!user || !pass) {
+    if (!user || pass) {
       return res.badRequest("User and password are required");
     }
killedBy: AuthenticationController signup should handle DB_ERROR when checking existing user or creating a new one
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/AuthenticationController.js:42:9
       return res.badRequest("User and password are required");
     }
 
-    try {
-      const newUser = await AuthenticationService.signup(user, pass);
-      req.session.userId = newUser.id;
-      return res.json({ message: `User ${newUser.user} signed up` });
-    } catch (error) {
+    try {} catch (error) {
       mapErrorToRes(error, res);
     }
killedBy: AuthenticationController signup should handle DB_ERROR when checking existing user or creating a new one
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/AuthenticationController.js:46:21
       const newUser = await AuthenticationService.signup(user, pass);
       req.session.userId = newUser.id;
       return res.json({ message: `User ${newUser.user} signed up` });
-    } catch (error) {
-      mapErrorToRes(error, res);
-    }
+    } catch (error) {}
   },
 
killedBy: AuthenticationController signup should handle DB_ERROR when checking existing user or creating a new one
statusReason: Unspecified AssertionError

[Killed] BlockStatement
api/controllers/AuthenticationController.js:51:31
     }
   },
 
-  status: function (req, res) {
-    if (req.session.userId) {
-      return res.json({ isAuthenticated: true });
-    } else {
-      return res.json({ isAuthenticated: false });
-    }
-  },
+  status: function (req, res) {},
   csrfToken: function (req, res) {
     return res.json({ csrfToken: req.csrfToken() });
killedBy: AuthenticationController status should return isAuthenticated: true if session.userId is set
statusReason: Cannot read properties of null (reading 'args')

[Killed] ConditionalExpression
api/controllers/AuthenticationController.js:52:9
   },
 
   status: function (req, res) {
-    if (req.session.userId) {
+    if (true) {
       return res.json({ isAuthenticated: true });
     } else {
killedBy: AuthenticationController status should return isAuthenticated: false if session.userId is not set
statusReason: expected { isAuthenticated: true } to have property 'isAuthenticated' of false, but got true

[Killed] BlockStatement
api/controllers/AuthenticationController.js:52:29
   },
 
   status: function (req, res) {
-    if (req.session.userId) {
-      return res.json({ isAuthenticated: true });
-    } else {
+    if (req.session.userId) {} else {
       return res.json({ isAuthenticated: false });
     }
killedBy: AuthenticationController status should return isAuthenticated: true if session.userId is set
statusReason: Cannot read properties of null (reading 'args')

[Killed] BooleanLiteral
api/controllers/AuthenticationController.js:53:42
 
   status: function (req, res) {
     if (req.session.userId) {
-      return res.json({ isAuthenticated: true });
+      return res.json({ isAuthenticated: false });
     } else {
       return res.json({ isAuthenticated: false });
killedBy: AuthenticationController status should return isAuthenticated: true if session.userId is set
statusReason: expected { isAuthenticated: false } to have property 'isAuthenticated' of true, but got false

[Killed] BlockStatement
api/controllers/AuthenticationController.js:54:12
   status: function (req, res) {
     if (req.session.userId) {
       return res.json({ isAuthenticated: true });
-    } else {
-      return res.json({ isAuthenticated: false });
-    }
+    } else {}
   },
   csrfToken: function (req, res) {
killedBy: AuthenticationController status should return isAuthenticated: false if session.userId is not set
statusReason: Cannot read properties of null (reading 'args')

[Killed] BooleanLiteral
api/controllers/AuthenticationController.js:55:42
     if (req.session.userId) {
       return res.json({ isAuthenticated: true });
     } else {
-      return res.json({ isAuthenticated: false });
+      return res.json({ isAuthenticated: true });
     }
   },
killedBy: AuthenticationController status should return isAuthenticated: false if session.userId is not set
statusReason: expected { isAuthenticated: true } to have property 'isAuthenticated' of false, but got true

[Killed] ObjectLiteral
api/controllers/AuthenticationController.js:55:23
     if (req.session.userId) {
       return res.json({ isAuthenticated: true });
     } else {
-      return res.json({ isAuthenticated: false });
+      return res.json({});
     }
   },
killedBy: AuthenticationController status should return isAuthenticated: false if session.userId is not set
statusReason: expected {} to have property 'isAuthenticated'

[Killed] BlockStatement
api/controllers/AuthenticationController.js:58:34
       return res.json({ isAuthenticated: false });
     }
   },
-  csrfToken: function (req, res) {
-    return res.json({ csrfToken: req.csrfToken() });
-  },
+  csrfToken: function (req, res) {},
 };
 
killedBy: AuthenticationController csrfToken should return the csrf token in json
statusReason: Unspecified AssertionError
