[Killed] ObjectLiteral
api/services/AuthenticationService.js:7:10
 const ErrorTypes = require("../constants/ErrorTypes");
 
 module.exports = (User) => {
-  return {
-    login,
-    logout,
-    signup,
-  };
+  return {};
 
   async function login(user, pass) {
killedBy: AuthenticationService login should throw DB_ERROR when User.findOne throws
statusReason: AuthenticationService.login is not a function

[Killed] BlockStatement
api/services/AuthenticationService.js:13:36
     signup,
   };
 
-  async function login(user, pass) {
-    let foundUser, matched;
-    try {
-      foundUser = await User.findOne({ user });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
-    matched = await bcrypt.compare(pass, foundUser.pass);
-    if (!foundUser || !matched) {
-      throw new Error(ErrorTypes.INVALID_CREDENTIALS);
-    }
-    delete foundUser.pass;
-    return foundUser;
-  }
+  async function login(user, pass) {}
 
   async function logout() {
killedBy: AuthenticationService login should throw DB_ERROR when User.findOne throws
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but it was fulfilled with undefined

[Killed] BlockStatement
api/services/AuthenticationService.js:15:9
 
   async function login(user, pass) {
     let foundUser, matched;
-    try {
-      foundUser = await User.findOne({ user });
-    } catch {
+    try {} catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
killedBy: AuthenticationService login should throw DB_ERROR when User.findOne throws
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
api/services/AuthenticationService.js:17:13
     let foundUser, matched;
     try {
       foundUser = await User.findOne({ user });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
+    } catch {}
     matched = await bcrypt.compare(pass, foundUser.pass);
     if (!foundUser || !matched) {
killedBy: AuthenticationService login should throw DB_ERROR when User.findOne throws
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
api/services/AuthenticationService.js:21:9
       throw new Error(ErrorTypes.DB_ERROR);
     }
     matched = await bcrypt.compare(pass, foundUser.pass);
-    if (!foundUser || !matched) {
+    if (false) {
       throw new Error(ErrorTypes.INVALID_CREDENTIALS);
     }
killedBy: AuthenticationService login should throw INVALID_CREDENTIALS when password does not match
statusReason: expected promise to be rejected with an error including 'Invalid credentials' but it was fulfilled with { id: 1, user: 'testUser' }

[Killed] BooleanLiteral
api/services/AuthenticationService.js:21:23
       throw new Error(ErrorTypes.DB_ERROR);
     }
     matched = await bcrypt.compare(pass, foundUser.pass);
-    if (!foundUser || !matched) {
+    if (!foundUser || matched) {
       throw new Error(ErrorTypes.INVALID_CREDENTIALS);
     }
killedBy: AuthenticationService login should throw INVALID_CREDENTIALS when password does not match
statusReason: expected promise to be rejected with an error including 'Invalid credentials' but it was fulfilled with { id: 1, user: 'testUser' }

[NoCoverage] BlockStatement
api/services/AuthenticationService.js:28:27
     return foundUser;
   }
 
-  async function logout() {
-    return;
-  }
+  async function logout() {}
 
   async function signup(user, pass) {

[Killed] BlockStatement
api/services/AuthenticationService.js:32:37
     return;
   }
 
-  async function signup(user, pass) {
-    let existingUser, newUser;
-    try {
-      existingUser = await User.findOne({ user });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
-    if (existingUser) {
-      throw new Error(ErrorTypes.USER_ALREADY_EXISTS);
-    }
-    const hashedPass = await bcrypt.hash(pass, HASH_ROUNDS);
-    try {
-      newUser = await User.create({ user, pass: hashedPass }).fetch();
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
-    delete newUser.pass;
-    return newUser;
-  }
+  async function signup(user, pass) {}
 };
 
killedBy: AuthenticationService signup should throw DB_ERROR when User.findOne throws
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but it was fulfilled with undefined

[Killed] BlockStatement
api/services/AuthenticationService.js:34:9
 
   async function signup(user, pass) {
     let existingUser, newUser;
-    try {
-      existingUser = await User.findOne({ user });
-    } catch {
+    try {} catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
killedBy: AuthenticationService signup should throw USER_ALREADY_EXISTS when user already exists
statusReason: expected promise to be rejected with an error including 'User already exists' but got 'Couldn\'t complete operation in the d…'

[Survived] ObjectLiteral
api/services/AuthenticationService.js:35:41
   async function signup(user, pass) {
     let existingUser, newUser;
     try {
-      existingUser = await User.findOne({ user });
+      existingUser = await User.findOne({});
     } catch {
       throw new Error(ErrorTypes.DB_ERROR);

[Survived] BlockStatement
api/services/AuthenticationService.js:36:13
     let existingUser, newUser;
     try {
       existingUser = await User.findOne({ user });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
+    } catch {}
     if (existingUser) {
       throw new Error(ErrorTypes.USER_ALREADY_EXISTS);

[Killed] BlockStatement
api/services/AuthenticationService.js:39:23
     } catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
-    if (existingUser) {
-      throw new Error(ErrorTypes.USER_ALREADY_EXISTS);
-    }
+    if (existingUser) {}
     const hashedPass = await bcrypt.hash(pass, HASH_ROUNDS);
     try {
killedBy: AuthenticationService signup should throw USER_ALREADY_EXISTS when user already exists
statusReason: expected promise to be rejected with an error including 'User already exists' but got 'Couldn\'t complete operation in the d…'

[Killed] ConditionalExpression
api/services/AuthenticationService.js:39:9
     } catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
-    if (existingUser) {
+    if (true) {
       throw new Error(ErrorTypes.USER_ALREADY_EXISTS);
     }
killedBy: AuthenticationService signup should throw DB_ERROR when User.create fails
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but got 'User already exists'

[Killed] BlockStatement
api/services/AuthenticationService.js:43:9
       throw new Error(ErrorTypes.USER_ALREADY_EXISTS);
     }
     const hashedPass = await bcrypt.hash(pass, HASH_ROUNDS);
-    try {
-      newUser = await User.create({ user, pass: hashedPass }).fetch();
-    } catch {
+    try {} catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
killedBy: AuthenticationService signup should throw DB_ERROR when User.create fails
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but got 'Cannot convert undefined or null to o…'

[Killed] BlockStatement
api/services/AuthenticationService.js:45:13
     const hashedPass = await bcrypt.hash(pass, HASH_ROUNDS);
     try {
       newUser = await User.create({ user, pass: hashedPass }).fetch();
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
+    } catch {}
     delete newUser.pass;
     return newUser;
killedBy: AuthenticationService signup should throw DB_ERROR when User.create fails
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but got 'Cannot convert undefined or null to o…'
