[Survived] ObjectLiteral
api/controllers/errorUtils.js:3:18
 const ErrorTypes = require("../constants/ErrorTypes");
 
-module.exports = {
-  mapErrorToRes,
-};
+module.exports = {};
 
 function mapErrorToRes(error, res) {

[Killed] BlockStatement
api/controllers/errorUtils.js:7:36
   mapErrorToRes,
 };
 
-function mapErrorToRes(error, res) {
-  switch (error.message) {
-    case ErrorTypes.DB_ERROR:
-      return res.serverError(error);
-    case ErrorTypes.INVALID_INPUT:
-      return res.badRequest(error);
-    case ErrorTypes.ENTITY_NOT_FOUND:
-      return res.notFound(error);
-    case ErrorTypes.INVALID_CREDENTIALS:
-      return res.unauthorized(error);
-    case ErrorTypes.USER_ALREADY_EXISTS:
-      return res.badRequest(error);
-    default:
-      return res.serverError(error);
-  }
-}
+function mapErrorToRes(error, res) {}
 
killedBy: AuthenticationController login should handle DB_ERROR from service
statusReason: Unspecified AssertionError

[Killed] ConditionalExpression
api/controllers/errorUtils.js:9:5
 
 function mapErrorToRes(error, res) {
   switch (error.message) {
-    case ErrorTypes.DB_ERROR:
-      return res.serverError(error);
+    case ErrorTypes.DB_ERROR:
     case ErrorTypes.INVALID_INPUT:
       return res.badRequest(error);
killedBy: AuthenticationController login should handle DB_ERROR from service
statusReason: Unspecified AssertionError

[Killed] ConditionalExpression
api/controllers/errorUtils.js:11:5
   switch (error.message) {
     case ErrorTypes.DB_ERROR:
       return res.serverError(error);
-    case ErrorTypes.INVALID_INPUT:
-      return res.badRequest(error);
+    case ErrorTypes.INVALID_INPUT:
     case ErrorTypes.ENTITY_NOT_FOUND:
       return res.notFound(error);
killedBy: ToDoController findOne Invalid param
statusReason: Unspecified AssertionError

[Killed] ConditionalExpression
api/controllers/errorUtils.js:13:5
       return res.serverError(error);
     case ErrorTypes.INVALID_INPUT:
       return res.badRequest(error);
-    case ErrorTypes.ENTITY_NOT_FOUND:
-      return res.notFound(error);
+    case ErrorTypes.ENTITY_NOT_FOUND:
     case ErrorTypes.INVALID_CREDENTIALS:
       return res.unauthorized(error);
killedBy: ToDoController findOne Entity not found
statusReason: res.unauthorized is not a function

[Killed] ConditionalExpression
api/controllers/errorUtils.js:15:5
       return res.badRequest(error);
     case ErrorTypes.ENTITY_NOT_FOUND:
       return res.notFound(error);
-    case ErrorTypes.INVALID_CREDENTIALS:
-      return res.unauthorized(error);
+    case ErrorTypes.INVALID_CREDENTIALS:
     case ErrorTypes.USER_ALREADY_EXISTS:
       return res.badRequest(error);
killedBy: AuthenticationController login should handle INVALID_CREDENTIALS from service
statusReason: Unspecified AssertionError

[Killed] ConditionalExpression
api/controllers/errorUtils.js:17:5
       return res.notFound(error);
     case ErrorTypes.INVALID_CREDENTIALS:
       return res.unauthorized(error);
-    case ErrorTypes.USER_ALREADY_EXISTS:
-      return res.badRequest(error);
+    case ErrorTypes.USER_ALREADY_EXISTS:
     default:
       return res.serverError(error);
killedBy: AuthenticationController signup should handle USER_ALREADY_EXISTS
statusReason: Unspecified AssertionError

[NoCoverage] ConditionalExpression
api/controllers/errorUtils.js:19:5
       return res.unauthorized(error);
     case ErrorTypes.USER_ALREADY_EXISTS:
       return res.badRequest(error);
-    default:
-      return res.serverError(error);
+    default:
   }
 }
