[Killed] ObjectLiteral
api/services/ToDoService.js:23:10
 */
 
 module.exports = (ToDo) => {
-  return {
-    create,
-    deleteById,
-    findAll,
-    findById,
-    changeState,
-    isValidToDoState,
-  };
+  return {};
 
   async function create(text, state, userId) {
killedBy: ToDoService create Successfully
statusReason: ToDoService.create is not a function

[Killed] BlockStatement
api/services/ToDoService.js:32:46
     isValidToDoState,
   };
 
-  async function create(text, state, userId) {
-    try {
-      return await ToDo.create({ text, state, owner: userId }).fetch();
-      // const aux = await ToDo.create({ text, state, owner: userId });
-      // return aux.fetch();
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
-  }
+  async function create(text, state, userId) {}
 
   async function deleteById(id, userId) {
killedBy: ToDoService create Successfully
statusReason: expected { id: 1, text: 'Test ToDo', …(2) } to deeply equal undefined

[Killed] BlockStatement
api/services/ToDoService.js:33:9
   };
 
   async function create(text, state, userId) {
-    try {
-      return await ToDo.create({ text, state, owner: userId }).fetch();
-      // const aux = await ToDo.create({ text, state, owner: userId });
-      // return aux.fetch();
-    } catch {
+    try {} catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
killedBy: ToDoService create Successfully
statusReason: expected { id: 1, text: 'Test ToDo', …(2) } to deeply equal undefined

[Killed] BlockStatement
api/services/ToDoService.js:37:13
       return await ToDo.create({ text, state, owner: userId }).fetch();
       // const aux = await ToDo.create({ text, state, owner: userId });
       // return aux.fetch();
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
+    } catch {}
   }
 
killedBy: ToDoService create With DB error
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but it was fulfilled with undefined

[Killed] BlockStatement
api/services/ToDoService.js:42:41
     }
   }
 
-  async function deleteById(id, userId) {
-    const foundToDo = await this.findById(id, userId);
-    try {
-      return await ToDo.destroyOne({ id: foundToDo.id });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
-  }
+  async function deleteById(id, userId) {}
 
   async function findAll(userId) {
killedBy: ToDoService delete Successfully
statusReason: expected { id: 1, text: 'Test ToDo', …(2) } to deeply equal undefined

[Killed] BlockStatement
api/services/ToDoService.js:44:9
 
   async function deleteById(id, userId) {
     const foundToDo = await this.findById(id, userId);
-    try {
-      return await ToDo.destroyOne({ id: foundToDo.id });
-    } catch {
+    try {} catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
killedBy: ToDoService delete Successfully
statusReason: expected { id: 1, text: 'Test ToDo', …(2) } to deeply equal undefined

[Killed] BlockStatement
api/services/ToDoService.js:46:13
     const foundToDo = await this.findById(id, userId);
     try {
       return await ToDo.destroyOne({ id: foundToDo.id });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
+    } catch {}
   }
 
killedBy: ToDoService delete With DB error
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but it was fulfilled with undefined

[Killed] BlockStatement
api/services/ToDoService.js:51:34
     }
   }
 
-  async function findAll(userId) {
-    try {
-      return await ToDo.find({ owner: userId });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
-  }
+  async function findAll(userId) {}
 
   async function findById(id, userId) {
killedBy: ToDoService findAll Successfully
statusReason: expected [ { id: 1, text: 'Test ToDo', …(2) } ] to deeply equal undefined

[Killed] BlockStatement
api/services/ToDoService.js:52:9
   }
 
   async function findAll(userId) {
-    try {
-      return await ToDo.find({ owner: userId });
-    } catch {
+    try {} catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
killedBy: ToDoService findAll Successfully
statusReason: expected [ { id: 1, text: 'Test ToDo', …(2) } ] to deeply equal undefined

[Killed] BlockStatement
api/services/ToDoService.js:54:13
   async function findAll(userId) {
     try {
       return await ToDo.find({ owner: userId });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
+    } catch {}
   }
 
killedBy: ToDoService findAll With DB error
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but it was fulfilled with undefined

[Killed] BlockStatement
api/services/ToDoService.js:59:39
     }
   }
 
-  async function findById(id, userId) {
-    let foundToDo;
-    try {
-      foundToDo = await ToDo.findOne({ id });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
-
-    if (!foundToDo) {
-      throw new Error(ErrorTypes.ENTITY_NOT_FOUND);
-    }
-
-    if (foundToDo.owner !== userId) {
-      throw new Error(ErrorTypes.INVALID_INPUT);
-    }
-    return foundToDo;
-  }
+  async function findById(id, userId) {}
 
   async function changeState(id, userId, state) {
killedBy: ToDoService findById Successfully
statusReason: expected { id: 1, text: 'Test ToDo', …(2) } to deeply equal undefined

[Killed] BlockStatement
api/services/ToDoService.js:61:9
 
   async function findById(id, userId) {
     let foundToDo;
-    try {
-      foundToDo = await ToDo.findOne({ id });
-    } catch {
+    try {} catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
killedBy: ToDoService findById Successfully
statusReason: Entity was not found

[Killed] BlockStatement
api/services/ToDoService.js:63:13
     let foundToDo;
     try {
       foundToDo = await ToDo.findOne({ id });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
+    } catch {}
 
     if (!foundToDo) {
killedBy: ToDoService findById With DB error
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but got 'Entity was not found'

[Killed] BlockStatement
api/services/ToDoService.js:67:21
       throw new Error(ErrorTypes.DB_ERROR);
     }
 
-    if (!foundToDo) {
-      throw new Error(ErrorTypes.ENTITY_NOT_FOUND);
-    }
+    if (!foundToDo) {}
 
     if (foundToDo.owner !== userId) {
killedBy: ToDoService findById Not found
statusReason: expected promise to be rejected with an error including 'Entity was not found' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
api/services/ToDoService.js:67:9
       throw new Error(ErrorTypes.DB_ERROR);
     }
 
-    if (!foundToDo) {
+    if (false) {
       throw new Error(ErrorTypes.ENTITY_NOT_FOUND);
     }
killedBy: ToDoService findById Not found
statusReason: expected promise to be rejected with an error including 'Entity was not found' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
api/services/ToDoService.js:71:9
       throw new Error(ErrorTypes.ENTITY_NOT_FOUND);
     }
 
-    if (foundToDo.owner !== userId) {
+    if (true) {
       throw new Error(ErrorTypes.INVALID_INPUT);
     }
killedBy: ToDoService findById Successfully
statusReason: The inputs are invalid

[Killed] ConditionalExpression
api/services/ToDoService.js:71:9
       throw new Error(ErrorTypes.ENTITY_NOT_FOUND);
     }
 
-    if (foundToDo.owner !== userId) {
+    if (false) {
       throw new Error(ErrorTypes.INVALID_INPUT);
     }
killedBy: ToDoService findById With different owner
statusReason: expected promise to be rejected with an error including 'The inputs are invalid' but it was fulfilled with { id: 1, text: 'Test ToDo', …(2) }

[Killed] BlockStatement
api/services/ToDoService.js:77:49
     return foundToDo;
   }
 
-  async function changeState(id, userId, state) {
-    const foundToDo = await this.findById(id, userId);
-    if (!this.isValidToDoState(state)) {
-      throw new Error(ErrorTypes.INVALID_INPUT);
-    }
-    try {
-      return await ToDo.updateOne({ id: foundToDo.id }).set({ state });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
-  }
+  async function changeState(id, userId, state) {}
 
   function isValidToDoState(state) {
killedBy: ToDoService changeState Successfully
statusReason: expected { id: 1, text: 'Test ToDo', …(2) } to deeply equal undefined

[Killed] ConditionalExpression
api/services/ToDoService.js:79:9
 
   async function changeState(id, userId, state) {
     const foundToDo = await this.findById(id, userId);
-    if (!this.isValidToDoState(state)) {
+    if (false) {
       throw new Error(ErrorTypes.INVALID_INPUT);
     }
killedBy: ToDoService changeState With incorrect state
statusReason: expected promise to be rejected with an error including 'The inputs are invalid' but got 'Couldn\'t complete operation in the d…'

[Killed] BooleanLiteral
api/services/ToDoService.js:79:9
 
   async function changeState(id, userId, state) {
     const foundToDo = await this.findById(id, userId);
-    if (!this.isValidToDoState(state)) {
+    if (this.isValidToDoState(state)) {
       throw new Error(ErrorTypes.INVALID_INPUT);
     }
killedBy: ToDoService changeState Successfully
statusReason: The inputs are invalid

[Killed] BlockStatement
api/services/ToDoService.js:82:9
     if (!this.isValidToDoState(state)) {
       throw new Error(ErrorTypes.INVALID_INPUT);
     }
-    try {
-      return await ToDo.updateOne({ id: foundToDo.id }).set({ state });
-    } catch {
+    try {} catch {
       throw new Error(ErrorTypes.DB_ERROR);
     }
killedBy: ToDoService changeState Successfully
statusReason: expected { id: 1, text: 'Test ToDo', …(2) } to deeply equal undefined

[Killed] BlockStatement
api/services/ToDoService.js:84:13
     }
     try {
       return await ToDo.updateOne({ id: foundToDo.id }).set({ state });
-    } catch {
-      throw new Error(ErrorTypes.DB_ERROR);
-    }
+    } catch {}
   }
 
killedBy: ToDoService changeState With DB error
statusReason: expected promise to be rejected with an error including 'Couldn\'t complete operation in the d…' but it was fulfilled with undefined

[Killed] BlockStatement
api/services/ToDoService.js:89:36
     }
   }
 
-  function isValidToDoState(state) {
-    return state === "PENDING" || state === "COMPLETED";
-  }
+  function isValidToDoState(state) {}
 };
 
killedBy: ToDoService changeState Successfully
statusReason: The inputs are invalid

[Killed] EqualityOperator
api/services/ToDoService.js:90:12
   }
 
   function isValidToDoState(state) {
-    return state === "PENDING" || state === "COMPLETED";
+    return state !== "PENDING" || state === "COMPLETED";
   }
 };
killedBy: ToDoService changeState With incorrect state
statusReason: expected promise to be rejected with an error including 'The inputs are invalid' but got 'Couldn\'t complete operation in the d…'

[Killed] EqualityOperator
api/services/ToDoService.js:90:35
   }
 
   function isValidToDoState(state) {
-    return state === "PENDING" || state === "COMPLETED";
+    return state === "PENDING" || state !== "COMPLETED";
   }
 };
killedBy: ToDoService changeState Successfully
statusReason: The inputs are invalid
